package com.vampir6307;

public class PartOneTaskFour {
    //    Выведите на экран диапазоны значений каждого из целочисленных примитивных типов.
    public static void main(String[] args) {
        System.out.println("byte имеет диапазоны значений от " + Byte.MIN_VALUE + " до " + Byte.MAX_VALUE);
        System.out.println("short имеет диапазоны значений от " + Short.MIN_VALUE + " до " + Short.MAX_VALUE);
        System.out.println("int имеет диапазоны значений от " + Integer.MIN_VALUE + " до " + Integer.MAX_VALUE);
        System.out.println("long имеет диапазоны значений от " + Long.MIN_VALUE + " до " + Long.MAX_VALUE);
    }
}
